[
  {
    "business_name": "Donhao",
    "review_text": "Renovated new Chinese restaurant in Danville \n\nFood was great taste and flavorful. \nAnd service was also great. \nMy favorite is Wagyu tofu\nI definitely come back. \nHighly recommend",
    "rating": 5,
    "user_name": "Atsushi K.",
    "date": "2024-08-17T19:46:38Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "I went there with my family a couple nights ago and it was amazing! The service was excellent I got the Lizhi cocktail and it was perfect I love any lychee. Some standouts were the orange chicken, fried fish, and the shrimp fried rice. Will definitely be back! The interior design was beautiful and definitely set up to have a great time.",
    "rating": 5,
    "user_name": "krystal s.",
    "date": "2024-08-28T21:38:37Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "We had a lovely family dinner filled with delicious food/ my son loved the fried rice.  The tofu and vegetables were so delicious and fresh and tender,  quite a great family meal",
    "rating": 5,
    "user_name": "Rene Z.",
    "date": "2024-09-06T04:08:31Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "Went for drinks last week then returned for dinner last night.\nSo happy with friendly service, so happy with fresh crisp Salt Pepper prawns, so enjoyed Tofu with Wagyu( trust me try it!) we are not tofu people but this was so flavorful and large portion to share.\nMezgo drink is perfectly prepared with Matcha salt rim. We will be back",
    "rating": 5,
    "user_name": "Mary B.",
    "date": "2024-09-28T20:49:18Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "Food was a 10/10.\n\nThe Sole is must order. Can't say that enough. \n\nKung Pao was 10/10, fresh and perfect amount of spice\n\nGreen beans were fresh and crunchy, perfect.\n\nService was attentive. \n\nRestaurant is beautiful. Only issue I have is the two seater tables are far too small given the size of the dishes. We had three dishes (rice, sole, and green beans) and we couldn't fit everything without boxing some up.\n\nWill definitely come again.",
    "rating": 5,
    "user_name": "Alissa O.",
    "date": "2024-09-27T01:17:01Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "One word: WOW \n\n*Finally* Danville has an amazing restaurant that hits all components; innovation, service, quality, taste, value, and atmosphere.  \n\nDonhao has taken over the former Kaori space. We enjoyed Kaori the few times we went, but always forgot to return. \nThe owners of Kaori have opened Donhao, but now partnering with nearby Aozora's owners. \n\nWe ordered:\n- Spicy Wontons (5/5): Highly recommended by our server, we will dream of this dish until we return. Spicy and acidic, flavorful, fresh, perfect. A must order for all future visits. \n- Vegetable chow mein (4.5/5): Incredibly fresh veggies, great flavor; the meal was so amazing that we had to nit pick to find a flaw and wished that the noodles were cooked just a tad bit more. \n- Chicken kung pao (5/5): WOW. For their chicken Donhao only use Mary's chicken, and the quality of the meat makes a world of difference... it made me have a \"so THIS is what it is supposed to taste like!\" moment about kung pao. Like the wonton appetizer, it was acidic with a good kick. Must try. \n- Milk tea panna cotta (5/5): We never order dessert, but the food was so good so far and the panna cotta was raved over by our server, so we decided to calorie splurge... INSANITY. Yum!! Graham cracker crumbs, kiwi and peaches, with a brown sugar milk tea panna cotta. Need I say more? \n\nFew things to note: \n- the atmosphere remains upscale and sexy; to me, it is the epitome of date night\n- the high quality of the ingredients, as well as the chef's spin on things, makes this a stand out restaurant. We came on a slow Thursday night, and we could overhear every other table comment MULTIPLE times about how fresh the ingredients are... the veggies are colorful, the beef is wagyu, the the chicken is Mary's- this is not like any other Chinese food in the area. \n- typically Danville has solid service, but the Donhao crew went above and beyond. Every member of the staff was incredibly friendly but professional, as well as attentive. Our bartender, Randy, made our visit exceptional. He ran us through the menu and offered his opinion, which was all spot on. I was craving a lychee martini and Randy took that idea and ran with it, making me a custom drink- asked me questions about my flavor palette, explained his thought process of what he had in mind, and allowed me to try (and deny) to ensure it was what I wanted. \n- The most shocking aspect to this restaurant is the value: the price points are the same as the turn and burn Chinese restaurants across the Bay Area. For one appetizer, two mains, a dessert, and two drinks we spent $100. That's ABSURD for what we got. \n\nI have already informed my husband that this is now our local date night restaurant!",
    "rating": 5,
    "user_name": "Kamryn W.",
    "date": "2024-08-31T06:38:13Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "It was good! I feel the lunch dish was fairly priced for the quality of the ingredients, come on, Wagyu. The waitress was nice and the restaurant was clean. I would come back to try other dishes.",
    "rating": 5,
    "user_name": "Kris D.",
    "date": "2024-09-14T20:52:36Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "Our family of 5 wanted to try Donhao after seeing an Instagram ad, but we also noticed that they have taken over the same space that Kaori was in. I'm not sure if it is still the same chef/owner. When trying to make a reservation through OpenTable, there was no party of 5 available but we were able to call and they confirmed that they could fit us 5. \n\nAs for the interior, it is still very similar to what it was before. Clean, lots of wood, and upscale/modern vibes. There is some outside seating with ceiling heaters. Our server (Zoie) was very attentive! \n\nAppetizers - not sure we would get any of them again as they were lacking flavor):\nSpicy Wontons (2.5/5) - not spicy at all. You could taste a tiny bit of sichuan. I am comparing this to Din Tai Fung. The dumplings itself were a decent size and easy to eat. There could definitely be more taste to the wontons as these were a bit bland.\nPan Fried Dumplings (2.5/5) - fried pretty well and had a slight crisp. However, the red sauce it came with was disappointing. It was watery and didn't taste like much.\n\nEntrees - much better than the appetizers!\nWalnut Shrimp (4/5) - very crispy and good sized pieces of shrimp. They were fried well and not dry. There could have been a bit more sauce. I do like how this was not as oily as the walnut shrimp from Koi Palace in Dublin. \nClassic Egg Fried Rice (3.8/5) - rather plain tasting (could have used a tiny bit more salt). However, it was a good accompaniment to the rest of the dishes we had to mop up any leftover sauce.\nGarlic String Beans (4/5) - good, salty taste. I wish they would have cut the pointed ends of the string beans off though, as they felt a bit tough to chew and swallow. Not Din Tai Fung status but still tasty!\nTofu with Wagyu Beef (4.5/5) - pleasantly surprised with this dish. I thought the wagyu beef could have been slightly softer. The tofu was cooked very well and was slightly crispy on the outside while still being soft on the inside. The brown sauce was tasty! I liked how each piece of tofu had a piece of beef on it - easy to share. \nMary's Orange Chicken (4/5) - was a bit surprised with the portion size when it came out. I would have liked it to be bigger. The chicken itself was pretty crispy and it did have a noticeable orange taste. The chicken wasn't dry.\n\nThere were two desserts that were not on the menu but were served due to the grand opening. Both were not that sweet. The milk tea panna cotta is definitely better than the sponge cake. Not a strong milk tea taste but the crumbles on the side complement the softness of the panna cotta well. A good dessert menu may be nice to see in the future.\n\nThere is potential at Donhao. The appetizers definitely need some work, but the entrees are good. Portion sizes could be larger for the price you pay (a bit pricey).",
    "rating": 4,
    "user_name": "Carson M.",
    "date": "2024-08-17T05:02:18Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "Clean flavors, quality ingredients and refreshingly unusual menu items.\nBeautifully presented in a well designed modern space . Lovely patio for outdoor dining! The mushroom dishes were fabulous.\nBest of all not very salty, just flavorful.\nExcellent  service too.",
    "rating": 5,
    "user_name": "Kumar M.",
    "date": "2024-08-26T06:25:59Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "We celebrated a great girls night dinner and we left fully fed and and and the best cocktails ever! The bartender is clever and creative / ask him to make you a crafted cocktail - you won't be disappointed/ trust me",
    "rating": 5,
    "user_name": "Catherine Z.",
    "date": "2024-09-06T04:11:59Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "Julian and the waitstaff was an amazing. Food was fresh, yummy and not covered in heavy sugary sauces. The restaurant was quiet even though it was busy. Very clean. Didn't try the bar fare but the drinks looked yummy. It was my mom's birthday and Julian made a fun treat for her.",
    "rating": 5,
    "user_name": "Gg R.",
    "date": "2024-09-28T02:44:36Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "My son and I went to dinner here last night.  We had the dumplings, fried rice, orange chicken, and black bean chicken.  The food was great and the service was quick and courteous.  The restaurant decor is little changed from the prior restaurant that used to be here, but it really didn't need much changing.   It's a beautiful restaurant. \n\nThe price is higher than every other Chinese restaurant in the area by a fair margin, but the food is also better.   This is the best Chinese restaurant in Danville or San Ramon, but you're going to look at the bill after you eat and think,  \"Damn",
    "rating": 5,
    "user_name": "Scott B.",
    "date": "2024-09-09T00:19:45Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "We are stuffed ! What a high quality feast tonight / the sophistication of each dish really made our senses sing.  I am Chinese American and very discerning about quality - the chef hear knows his technique.  I loved the orange chicken and the stir fried green beans / we also loved the creative cocktails / the mezgo with the mango purée is simply magic ....",
    "rating": 5,
    "user_name": "Sophia X.",
    "date": "2024-09-06T04:14:49Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "The family decided to embark on a culinary adventure at the latest hotspot in town. The potstickers and spring rolls were a delightful start, clearly crafted with care and bursting with flavor. As for the main course, we indulged in a feast of chicken chow mein, chicken fried rice, honey walnut prawns, and beef Mongolian. Each dish was a hit with everyone at the table. The fried rice was simply outstanding, and the honey walnut prawns were a masterpiece. Needless to say, a return visit is already in the works.",
    "rating": 5,
    "user_name": "Manny E.",
    "date": "2024-09-05T03:19:34Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "Omg! What a GREAT date night place.  Amazingly creating cocktails and delicious food - portions are generous and service is gracious",
    "rating": 5,
    "user_name": "Cassindy C.",
    "date": "2024-09-06T02:49:09Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "We had a wonderful birthday dinner here. Great food wonderful service and well decorated. Get the General Tso chicken. It's delicious!",
    "rating": 5,
    "user_name": "tracey b.",
    "date": "2024-09-06T00:31:50Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "We went to the grand opening of DonHao tonight.  As big fans of Aozora, we had high expectations since it is owned by the same people, and our expectations were exceeded. Excellent food - healthy, clean and delicious.  The restaurant is beautiful and the service was extremely friendly and welcoming. Our server, Antonio, was the best! It was a lovely night - high quality and delicious food, great drinks, awesome service. We will be here regularly I'm sure.",
    "rating": 5,
    "user_name": "Kristi W.",
    "date": "2024-08-18T03:44:43Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "Just opened, MUST TRY! Food is spectacular \nService is excellent, thanks Julian!! Love the space!",
    "rating": 5,
    "user_name": "Jennifer J.",
    "date": "2024-08-23T03:03:49Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "Amazing! The food was so good - the wagyu tofu and the mary's orange chicken were the best. Great ambiance and service. Also a solid cocktail menu :)",
    "rating": 5,
    "user_name": "Julie C.",
    "date": "2024-09-02T00:48:33Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "Great service , wonderful food and excellent cocktails .\nChinese food with a special touch '\nWe'll be back , soon !",
    "rating": 5,
    "user_name": "Marilyn C.",
    "date": "2024-09-06T05:59:12Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "After having a pleasant lunch here, we went for dinner. Appetizers were good but the entrees weren't. The four of us didn't get our entrees at the same time. My beef dish was cold and the beef, Wagu supposedly, was rubbery. My friend's fish came ten minutes after the rest of our food albeit with apology for the busy fryer.",
    "rating": 3,
    "user_name": "Charles C.",
    "date": "2024-09-15T16:12:42Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "The food was excellent quality, clean and flavorful.  I would rate it 5 stars on the food alone.\nWe had the spicy won tons, spring rolls, fried dumplings, roast duck, walnut prawns, generals chicken, chow mein, and panacotta dessert.  Our favorites were the wontons, generals chicken and chow mein.\nPortions are on the smaller side, but it was enough to feed the four of us, including two hungry men, with no left overs to pack up.\nI know they have only been open for a couple of months, so the service could be elevated a bit. For example, I called to make a reservation which they took... asked me if there was a special occasion and I confirmed that it was a birthday.  When we showed up, they did not have my reservation. We were able to get a table, no problem.  Nothing to celebrate the birthday.  Not sure why they asked in the first place.  Even though it seemed to be a slow night, service was slower than you would expect.\nWe ordered a couple of their specialty drinks.  One was like a mai tai and the other had a coffee flavor.  Both had too much lemon/citrus for our tastes, so we switched to old fashions with Toki Suntory whisky.  Very good.\nAll in all, we enjoyed the experience, and all agreed that we would return.",
    "rating": 5,
    "user_name": "Lorie V.",
    "date": "2024-09-13T19:48:04Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "Looking for a new Chinese Restaurant because I go out to lunch two to three times per week. Tried this one; nice decor with up scale feel. Quality meat and ingredients. Food tasted good except egg roll - too greasy. Their Lunch specials included both a nice little salad and soup but very limited on main course choices. And they will not substitute (Example: they offer Sweet and Sour Pork but can't get Sweet and Sour Chicken). And it doesn't make sense for one person to order a full order of soup, rice, main dish, etc...would be too expensive. Lunch specials are great since they are usually around $20 and include a full meal.",
    "rating": 4,
    "user_name": "Brenda W.",
    "date": "2024-09-06T17:05:17Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "This is a new restaurant, and so our expectations were limited. These folks way surpassed that. The menu is basic but well presented and prepared. Servers are  it just attentive but attentive. Looking forward to coming back!",
    "rating": 5,
    "user_name": "Ann B.",
    "date": "2024-08-18T03:20:16Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "Great food and environment, servers are very attentive and checked in on us regularly. Great place to eat overall!",
    "rating": 5,
    "user_name": "Kevin Y.",
    "date": "2024-08-15T19:42:02Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  },
  {
    "business_name": "Donhao",
    "review_text": "Great food! We did went with take out but the ambiance looks fantastic. It's a bit pricy but worth it.",
    "rating": 5,
    "user_name": "Glenn H.",
    "date": "2024-09-02T02:56:59Z",
    "location": "Danville, CA",
    "place_id": "No place ID available"
  }
]